** Printed Representation and Read Syntax
   The /printed representation/ is the format of the output generate by Lisp
   printer (the func ~prin1~) for that object. Every data type has a unique
   printed representation. The /read syntax/ of an  object is the format of the
   input accepted by the Lisp reader (the function ~read~) for that object. This
   is not unique many objects have more than one read syntax. For example the
   Lisp Object numera 1 has the read syntax ~1~ and ~1.~ both produces Lisp
   Object which reprsents literal 1. In most cases the object's printer
   representation is also the read syntax of an object. However some types
   doesn't have read syntax at all, since it doesn't make sense to enter objects
   of these types as constants in Lisp program. These objects are printed in
   hash notation, which consists of the characters '#<', a descriptive string
   (typically the type name followed by the name of the object) and a closing
   '>'.
   
   #+BEGIN_SRC emacs-lisp
     (current-buffer)
   #+END_SRC

   #+RESULTS:
   : #<buffer emacs-notes.org>

   Hash notation cannot be read at all.
   *In other languages an expression is a text. But in Lisp an expression is a
   Lisp Object and secondarily a text*.
   
